# SculptingCurvesCrossAxis Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..SculptingCurvesCrossAxis Property
BuiltInFailures..::..SketchFailures Class See Also
---
The highlighted curves cross the axis.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SculptingCurvesCrossAxis { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SculptingCurvesCrossAxis As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SculptingCurvesCrossAxis {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace